# შევქმენით სია nums რიცხვებით [2, 4, 8, 9, 5]                      

# ჩავსვით რიცხვი 3 პირველ ინდექსზე (მეორე პოზიციაზე)

nums = [2, 4, 8, 9, 5]

nums.insert(1, 3)  # ახლა სია არის [2, 3, 4, 8, 9, 5]

nums.remove(9)   # წავშალეთ რიცხვი 9, ახლა სია არის [2, 3, 4, 8, 5]

# დავითვალეთ რამდენჯერ გვხვდება 8 სიაში (1-ჯერ) 

# და ეს რიცხვი ჩავსვით საწყის პოზიციაზე

nums.insert(0, nums.count(8))  # ახლა სია არის [1, 2, 3, 4, 8, 5]

print(nums[3])    # დავბეჭდეთ მე-4 ელემენტი (ინდექსი 3), რაც არის 4



