
// 1-დან 100-მდე რიცხვები, შეწყვეტა 50-ზე და გამოტოვება თუ იყოფა 4-ზე ნაშთით

for (let i = 1; i <= 100; i++) {
    if (i === 50) {
        break;
    }
    if (i % 4 !== 0) {
        console.log(i);
    }
}

// 1-დან 20-მდე რიცხვები, გამოტოვებით 7 და 13

for (let i = 1; i <= 20; i++) {
    if (i === 7 || i === 13) {
        continue;
    }
    console.log(i);
}

// 1-დან 30-მდე, გამოტოვებით კენტი რიცხვები და შეწყვეტით თუ იყოფა 8-ზე

for (let i = 1; i <= 30; i++) {
    if (i % 2 !== 0) {
        continue;
    }
    if (i % 8 === 0) {
        break;
    }
    console.log(i);
}

// 1-დან 30-მდე, გამოტოვებით რიცხვები რომლებიც იყოფა 5-ზე

for (let i = 1; i <= 30; i++) {
    if (i % 5 === 0) {
        continue;
    }
    console.log(i);
}


