                                            



# iteration არის რაღაცის ბევჯერ ან უსასრულოდ გამეორება.

# sequences არის დალაგებული მოქმედების თანმიმდევრობა რომელიც დასაწყისიდან ბოლოში მიდის.

# selection არის რამე არჩევნის გაკეთება.

# selection მაგალითი: მიდიხარ მაღაზიაში, შეგიძლია რომ წახვიდე გრძელი გზით, ან მოკლე, შეიძლება მანქანით, ავტობუსით და ა.შ.




road = (input("შეიყვანეთ თქვენი გზის დისტანცია: "))

if road == "მოკლე გზა":
    distance = "მოკლე"
if road == "გრძელი გზა":

    distance = "გრძელი"



    print("თქვენ აირჩიეთ:", distance)